artillery_load/artillery.yaml
config:
  # target: "http://EXTERNAL-IP"
  target: "http://169.62.94.60"
  phases:
    - duration: 60
      arrivalRate: 15
  processor: "./artillery.js"
scenarios:
  - name: "destination"
    flow:
    - function: "getDestination"
    - get:
        url: "/api/v1/destinations/{{ country }}/{{ city }}"
  - name: "hotel"
    flow:
    - function: "getDestination"
    - get:
        url: "/api/v1/hotels/{{ country }}/{{ city }}?dateFrom=2020-08-23&dateTo=2020-08-25"
  - name: "carrental"
    flow:
    - function: "getDestination"
    - get:
        url: "/api/v1/cars/{{ country }}/{{ city }}?dateFrom=2020-08-23&dateTo=2020-08-25"